wfhit/synapse_pilot/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
	/* Read current FCR value first (DFRobot subSerialRegConfig pattern) */
	ret = wk2132_i2c_read_reg(priv, WK2132_FCR, &fcr_current);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to read FCR register for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Current FCR=0x%02x for port %d\n", fcr_current, priv->port);

	/* Apply DFRobot FCR settings using OR operation like subSerialRegConfig */
	uint8_t fcr_settings = WK2132_FCR_RFRST |     /* Reset RX FIFO (rfRst = 1) */
			       WK2132_FCR_TFRST |     /* Reset TX FIFO (tfRst = 1) */
			       WK2132_FCR_RFEN |      /* Enable RX FIFO (rfEn = 1) */
			       WK2132_FCR_TFEN;       /* Enable TX FIFO (tfEn = 1) */
	/* Trigger levels default to 0 (rfTrig = 0, tfTrig = 0) */

	ret = wk2132_i2c_write_reg(priv, WK2132_FCR, fcr_settings);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write FCR register for port %d\n", priv->port);
		goto errout;
	}

	/* Allow FIFO reset to complete, then clear reset bits.
	 * Reset bits may not be auto-clearing on all WK2132 variants —
	 * leaving them set would keep the FIFOs in reset state. */
	usleep(1000);
	uint8_t fcr_enable = WK2132_FCR_RFEN | WK2132_FCR_TFEN;
	ret = wk2132_i2c_write_reg(priv, WK2132_FCR, fcr_enable);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to clear FCR reset bits for port %d\n", priv->port);
		goto errout;
	}

	/* Read back for verification */
	uint8_t fcr_verify = 0;
	ret = wk2132_i2c_read_reg(priv, WK2132_FCR, &fcr_verify);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to verify FCR register for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Set FCR=0x%02x (was 0x%02x) for port %d\n",
	       fcr_verify, fcr_current, priv->port);

	/* Allow FIFO configuration to settle */
	usleep(25000);  /* 25ms delay */

	/* Step 7: Sub UART LCR configuration */
	/* Configure LCR based on settings according to datasheet */
	/* Note: WK2132 supports only 8-bit data length (fixed) */
	/* LCR Register bits from datasheet image:
	 * Bit 6: Reserved (0)
	 * Bit 5: BREAK - Line Break output enable
	 * Bit 4: IREN - IR mode enable
	 * Bit 3: PAEN - Parity enable
	 * Bit 2-1: PAM1-0 - Parity mode (10=Even, 01=Odd, 00=Reserved, 11=Mark/Space)
	 * Bit 0: STB - Stop bits (0=1bit, 1=2bits)
	 */

	/* Configure stop bits */
	if (priv->stopbits2) {
		lcr |= WK2132_LCR_STB;  /* 2 stop bits */
	}

	/* Configure parity according to datasheet and termios standards */
	switch (priv->parity) {
	case 0:  /* No parity */
		/* PAEN=0, no parity bits needed */
		break;

	case 1:  /* Odd parity */
		lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM0;  /* Enable parity, PAM1=0,PAM0=1 for odd */
		break;

	case 2:  /* Even parity */
		lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM1;  /* Enable parity, PAM1=1,PAM0=0 for even */
		break;

	default:
		syslog(LOG_WARNING, "WK2132: Invalid parity mode %lu, using no parity\n", (unsigned long)priv->parity);
		break;
	}

	ret = wk2132_i2c_write_reg(priv, WK2132_LCR, lcr);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write LCR register for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Set LCR=0x%02x for port %d\n", lcr, priv->port);

	/* Step 8: Sub UART baud rate configuration */
	/* Set baud rate */
	ret = wk2132_set_baud(priv, priv->baud);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to set baud rate %lu for port %d\n", (unsigned long)priv->baud, priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Set baud rate %lu for port %d\n", (unsigned long)priv->baud, priv->port);

	/* Allow baud rate configuration to settle */
	usleep(50000);  /* 50ms delay */

	/* Step 9: Sub UART receive/transmit enable (DFRobot: sScrReg_t scr = {.rxEn = 0x01, .txEn = 0x01, .sleepEn = 0x00, .rsv = 0x00}) */
	syslog(LOG_DEBUG, "WK2132: Sub UART receive/transmit enable for port %d\n", priv->port);
	uint8_t scr = WK2132_SCR_RXEN | WK2132_SCR_TXEN;  /* Enable RX and TX, disable sleep mode */

	ret = wk2132_i2c_write_reg(priv, WK2132_SCR, scr);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to write SCR register for port %d\n", priv->port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Set SCR=0x%02x for port %d (RX/TX enabled)\n", scr, priv->port);

	/* Allow final configuration to settle */
	usleep(50000);  /* 50ms delay */

	syslog(LOG_INFO, "WK2132: Setup completed successfully for port %d\n", priv->port);

	/* Diagnostic: read back key registers to verify setup */
	{
		uint8_t v;
		wk2132_i2c_read_global(priv, WK2132_GENA, &v);
		syslog(LOG_DEBUG, "WK2132: port %d GENA=0x%02x\n", priv->port, v);
		wk2132_i2c_read_global(priv, WK2132_GRST, &v);
		syslog(LOG_DEBUG, "WK2132: port %d GRST=0x%02x\n", priv->port, v);
		wk2132_i2c_read_reg(priv, WK2132_SCR, &v);
		syslog(LOG_DEBUG, "WK2132: port %d SCR=0x%02x\n", priv->port, v);
		wk2132_i2c_read_reg(priv, WK2132_FCR, &v);
		syslog(LOG_DEBUG, "WK2132: port %d FCR=0x%02x\n", priv->port, v);
		wk2132_i2c_read_reg(priv, WK2132_LCR, &v);
		syslog(LOG_DEBUG, "WK2132: port %d LCR=0x%02x\n", priv->port, v);
		wk2132_i2c_read_reg(priv, WK2132_FSR, &v);
		syslog(LOG_DEBUG, "WK2132: port %d FSR=0x%02x\n", priv->port, v);
		wk2132_i2c_read_reg(priv, WK2132_SPAGE, &v);
		syslog(LOG_DEBUG, "WK2132: port %d SPAGE=0x%02x\n", priv->port, v);
	}

	/* Step 10: Enable polling for this port */
	/* Start polling if not already started (with proper synchronization) */
	nxsem_wait(&g_wk2132_poll_sem);

	if (!g_wk2132_poll_running) {
		g_wk2132_poll_running = true;
		ret = work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL, 0);

		if (ret < 0) {
			syslog(LOG_ERR, "WK2132: Failed to start polling worker: %d\n", ret);
			g_wk2132_poll_running = false;  /* Reset on failure */
			nxsem_post(&g_wk2132_poll_sem);
			goto errout;
		}

		syslog(LOG_INFO, "WK2132: Started global polling\n");
	}

	nxsem_post(&g_wk2132_poll_sem);

	/* Mark device as enabled only after everything succeeds */
	priv->enabled = true;

errout:
	nxsem_post(&priv->exclsem);
	return ret;
}

/**
 * @brief Shutdown UART port
 */
static void wk2132_shutdown(FAR struct uart_dev_s *dev)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
	uint8_t gena;
	int i;
	bool any_enabled = false;

	/* Mark device as disabled first */
	priv->enabled = false;

	/* Disable all interrupts */
	wk2132_i2c_write_reg(priv, WK2132_SIER, 0x00);

