wfhit/synapse_pilot/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
	/* Disable the UART port in global register (protected by global sem) */
	nxsem_wait(&g_wk2132_poll_sem);

	if (wk2132_i2c_read_global(priv, WK2132_GENA, &gena) >= 0) {
		uint8_t gena_bit = 1 << (priv->port - 1);
		gena &= ~gena_bit;
		wk2132_i2c_write_global(priv, WK2132_GENA, gena);
	}

	nxsem_post(&g_wk2132_poll_sem);

	/* Check if any devices are still enabled */
	nxsem_wait(&g_wk2132_poll_sem);

	for (i = 0; i < g_wk2132_device_count; i++) {
		if (g_wk2132_devices[i] != NULL) {
			FAR struct wk2132_dev_s *check_priv =
				(FAR struct wk2132_dev_s *)g_wk2132_devices[i]->priv;

			if (check_priv->enabled) {
				any_enabled = true;
				break;
			}
		}
	}

	/* If no devices are enabled, stop polling */
	if (!any_enabled && g_wk2132_poll_running) {
		g_wk2132_poll_running = false;
		work_cancel(LPWORK, &g_wk2132_poll_work);
		syslog(LOG_INFO, "WK2132: Stopped global polling - no devices enabled\n");
	}

	nxsem_post(&g_wk2132_poll_sem);
}

/**
 * @brief Attach interrupt (not used in polled mode)
 */
static int wk2132_attach(FAR struct uart_dev_s *dev)
{
	return OK;
}

/**
 * @brief Detach interrupt (not used in polled mode)
 */
static void wk2132_detach(FAR struct uart_dev_s *dev)
{
	/* Nothing to do */
}

/**
 * @brief IOCTL handler
 */
static int wk2132_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
	FAR struct inode *inode = filep->f_inode;
	FAR struct uart_dev_s *dev = inode->i_private;
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
	int ret = OK;

	switch (cmd) {
	case TCGETS: {
			FAR struct termios *termiosp = (FAR struct termios *)arg;

			if (!termiosp) {
				ret = -EINVAL;
				break;
			}

			/* Return current settings */
			termiosp->c_cflag = 0;

			/* WK2132 only supports 8-bit data according to datasheet */
			termiosp->c_cflag |= CS8;

			if (priv->stopbits2) {
				termiosp->c_cflag |= CSTOPB;
			}

			if (priv->parity == 1) {
				termiosp->c_cflag |= PARENB | PARODD;

			} else if (priv->parity == 2) {
				termiosp->c_cflag |= PARENB;
			}

			/* Set baud rate */
			cfsetispeed(termiosp, priv->baud);
			cfsetospeed(termiosp, priv->baud);
		}
		break;

	case TCSETS: {
			FAR struct termios *termiosp = (FAR struct termios *)arg;

			if (!termiosp) {
				ret = -EINVAL;
				break;
			}

			/* Extract new settings */
			priv->baud = cfgetispeed(termiosp);

			/* WK2132 only supports 8-bit data according to datasheet */
			priv->nbits = 8;

			priv->stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;

			if (termiosp->c_cflag & PARENB) {
				priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;

			} else {
				priv->parity = 0;
			}

			/* Reconfigure the UART safely without disrupting polling */
			ret = wk2132_reconfigure(dev);

			if (ret < 0) {
				syslog(LOG_ERR, "WK2132: Failed to reconfigure UART port %d: %d\n", priv->port, ret);
				/* On reconfigure failure, we should still return the error but the device remains usable with old settings */
			}
		}
		break;

	default:
		ret = -ENOTTY;
		break;
	}

	return ret;
}

/**
 * @brief Receive character from staging buffer
 *
 * Called by uart_recvchars() after the poll worker has filled the staging
 * buffer via bulk I2C FIFO read.  No I2C happens here — purely a memory
 * read from the staging buffer.
 */
static int wk2132_receive(FAR struct uart_dev_s *dev, unsigned int *status)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

	*status = 0;

	if (priv->rx_staging_pos >= priv->rx_staging_count) {
		return -EAGAIN;
	}

	return priv->rx_staging[priv->rx_staging_pos++];
}

/**
 * @brief Enable/disable RX interrupt (no-op for polled driver)
 *
 * The NuttX serial framework calls this from within a critical section
 * (interrupts disabled) during uart_read().  I2C transactions inside a
 * critical section would deadlock if the I2C driver uses interrupts.
 * Since we use polling (not interrupts), this is safely a no-op.
 */
static void wk2132_rxint(FAR struct uart_dev_s *dev, bool enable)
{
	/* Polled mode — RX is always active via the poll worker */
}

/**
 * @brief Check if RX data available in staging buffer
 *
 * No I2C — checks the staging buffer that was filled by the poll worker.
 */
static bool wk2132_rxavailable(FAR struct uart_dev_s *dev)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
	return priv->rx_staging_pos < priv->rx_staging_count;
}

/**
 * @brief Send character to TX staging ring buffer
 *
 * No I2C here — bytes are accumulated in the staging buffer and
 * bulk-written to the WK2132 TX FIFO by the poll worker.
 */
static void wk2132_send(FAR struct uart_dev_s *dev, int ch)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

	if (!priv->enabled) {
		return;
	}

	uint16_t next_head = (priv->tx_staging_head + 1) & (WK2132_FIFO_SIZE - 1);

	if (next_head != priv->tx_staging_tail) {
		priv->tx_staging[priv->tx_staging_head] = (uint8_t)ch;
		priv->tx_staging_head = next_head;
	}
}

/**
 * @brief Enable/disable TX interrupt
 *
 * In polled mode, txint(true) means "there is data ready to transmit".
 * We track the flag locally so the poll worker knows when to call
 * uart_xmitchars().  No I2C here — safe to call from critical sections.
 */
static void wk2132_txint(FAR struct uart_dev_s *dev, bool enable)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

	if (!priv->enabled) {
		return;
	}

	priv->txint_enabled = enable;
}

/**
 * @brief Check if TX staging ring buffer has space
 *
 * No I2C — checks local ring buffer only.
 */
static bool wk2132_txready(FAR struct uart_dev_s *dev)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

	if (!priv->enabled) {
		return false;
	}

	uint16_t next_head = (priv->tx_staging_head + 1) & (WK2132_FIFO_SIZE - 1);
	return next_head != priv->tx_staging_tail;
}

/**
 * @brief Check if TX staging ring buffer is empty
 *
 * No I2C — checks local ring buffer only.
 */
static bool wk2132_txempty(FAR struct uart_dev_s *dev)
{
	FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

	if (!priv->enabled) {
		return true;
	}

	return priv->tx_staging_head == priv->tx_staging_tail;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/**
 * @brief Initialize a WK2132 UART port
 */
FAR struct uart_dev_s *wk2132_uart_init(FAR struct i2c_master_s *i2c,
					uint8_t base_addr, uint8_t port)
{
	FAR struct wk2132_dev_s *priv;
	FAR struct uart_dev_s *dev;
	int ret;

	syslog(LOG_INFO, "WK2132: Initializing port %d with base_addr 0x%02x\n", port, base_addr);

	/* Validate parameters */
	if (!i2c || port < 1 || port > WK2132_MAX_PORTS) {
		syslog(LOG_ERR, "WK2132: Invalid parameters - i2c=%p, port=%d (valid range 1-%d)\n",
		       i2c, port, WK2132_MAX_PORTS);
		return NULL;
	}

	/* Allocate device structures */
	priv = (FAR struct wk2132_dev_s *)kmm_zalloc(sizeof(struct wk2132_dev_s));

	if (priv == NULL) {
		syslog(LOG_ERR, "WK2132: Failed to allocate private structure for port %d\n", port);
		return NULL;
	}

