wfhit/synapse_pilot/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
	syslog(LOG_DEBUG, "WK2132: Allocated private structure for port %d\n", port);

	dev = (FAR struct uart_dev_s *)kmm_zalloc(sizeof(struct uart_dev_s));

	if (dev == NULL) {
		syslog(LOG_ERR, "WK2132: Failed to allocate uart_dev_s structure for port %d\n", port);
		kmm_free(priv);
		return NULL;
	}

	syslog(LOG_DEBUG, "WK2132: Allocated uart_dev_s structure for port %d\n", port);

	/* Initialize private structure */
	priv->i2c       = i2c;
	priv->base_addr = base_addr;
	priv->port      = port;
	priv->baud      = 115200;  /* Default baud rate */
	priv->parity    = 0;       /* No parity */
	priv->nbits     = 8;       /* 8 data bits */
	priv->stopbits2 = false;   /* 1 stop bit */
	priv->enabled   = false;
	priv->rx_staging_count = 0;
	priv->rx_staging_pos   = 0;
	priv->tx_staging_head  = 0;
	priv->tx_staging_tail  = 0;
	priv->txint_enabled    = false;
	priv->cached_fsr       = 0;
	priv->fsr_valid        = false;

	nxsem_init(&priv->exclsem, 0, 1);

	syslog(LOG_DEBUG, "WK2132: Initialized private structure - port=%d, baud=%lu, bits=%lu\n",
	       priv->port, (unsigned long)priv->baud, priv->nbits);

	/* Initialize public structure */
	dev->ops      = &g_wk2132_uart_ops;
	dev->priv     = priv;
	dev->isconsole = false;

	/* Allocate RX/TX buffers - increased to 512 bytes for better performance */
	dev->xmit.size   = 512;
	dev->xmit.buffer = (FAR char *)kmm_malloc(dev->xmit.size);

	if (dev->xmit.buffer == NULL) {
		syslog(LOG_ERR, "WK2132: Failed to allocate TX buffer for port %d\n", port);
		goto errout;
	}

	dev->recv.size   = 512;
	dev->recv.buffer = (FAR char *)kmm_malloc(dev->recv.size);

	if (dev->recv.buffer == NULL) {
		syslog(LOG_ERR, "WK2132: Failed to allocate RX buffer for port %d\n", port);
		goto errout;
	}

	syslog(LOG_DEBUG, "WK2132: Allocated TX/RX buffers (512 bytes each) for port %d\n", port);

	/* Test if device is present by reading a global register */
	uint8_t test;
	syslog(LOG_DEBUG, "WK2132: Testing device presence at base_addr 0x%02x\n", base_addr);
	ret = wk2132_i2c_read_global(priv, WK2132_GENA, &test);

	if (ret < 0) {
		syslog(LOG_ERR, "WK2132: Failed to detect device at base_addr 0x%02x (error=%d)\n", base_addr, ret);
		goto errout;
	}

	syslog(LOG_INFO, "WK2132: Device detected at base_addr 0x%02x, GENA=0x%02x\n", base_addr, test);

	/* Add to device list for polling */
	if (g_wk2132_device_count < WK2132_MAX_PORTS) {
		g_wk2132_devices[g_wk2132_device_count++] = dev;
		syslog(LOG_DEBUG, "WK2132: Added device to polling list, count=%d\n", g_wk2132_device_count);

	} else {
		syslog(LOG_WARNING, "WK2132: Maximum device count reached, polling may not work for port %d\n", port);
	}

	syslog(LOG_INFO, "WK2132: Initialized port %d with base_addr 0x%02x\n", port, base_addr);
	return dev;

errout:

	if (dev->xmit.buffer) {
		kmm_free(dev->xmit.buffer);
	}

	if (dev->recv.buffer) {
		kmm_free(dev->recv.buffer);
	}

	kmm_free(dev);
	kmm_free(priv);
	return NULL;
}

/**
 * @brief Register WK2132 serial devices
 */
int wk2132_register_devices(int i2c_bus, uint8_t i2c_base_addr,
			    int base_tty, int num_ports)
{
	FAR struct i2c_master_s *i2c;
	FAR struct uart_dev_s *devs[WK2132_MAX_PORTS];
	char devpath[16];
	int i;
	int ret;

	syslog(LOG_INFO, "WK2132: Registering %d devices on I2C%d, base_addr=0x%02x, base_tty=%d\n",
	       num_ports, i2c_bus, i2c_base_addr, base_tty);

	/* Validate parameters */
	if (num_ports < 1 || num_ports > WK2132_MAX_PORTS) {
		syslog(LOG_ERR, "WK2132: Invalid num_ports=%d (valid range 1-%d)\n", num_ports, WK2132_MAX_PORTS);
		return -EINVAL;
	}

	/* Get I2C bus instance */
	syslog(LOG_DEBUG, "WK2132: Initializing I2C%d bus\n", i2c_bus);
	i2c = stm32_i2cbus_initialize(i2c_bus);

	if (i2c == NULL) {
		syslog(LOG_ERR, "WK2132: Failed to get I2C%d\n", i2c_bus);
		return -ENODEV;
	}

	syslog(LOG_DEBUG, "WK2132: I2C%d bus initialized successfully\n", i2c_bus);

	/* Initialize UART ports */
	for (i = 0; i < num_ports; i++) {
		syslog(LOG_DEBUG, "WK2132: Initializing UART port %d\n", i + 1);
		devs[i] = wk2132_uart_init(i2c, i2c_base_addr, i + 1);

		if (devs[i] == NULL) {
			syslog(LOG_ERR, "WK2132: Failed to initialize port %d\n", i + 1);
			ret = -ENODEV;
			goto cleanup;
		}

		syslog(LOG_DEBUG, "WK2132: Successfully initialized UART port %d\n", i + 1);
	}

	/* Register UART devices */
	for (i = 0; i < num_ports; i++) {
		snprintf(devpath, sizeof(devpath), "/dev/ttyS%d", base_tty + i);
		syslog(LOG_DEBUG, "WK2132: Registering device %s for port %d\n", devpath, i + 1);
		ret = uart_register(devpath, devs[i]);

		if (ret < 0) {
			syslog(LOG_ERR, "WK2132: Failed to register %s (error=%d)\n", devpath, ret);
			goto cleanup;
		}

		syslog(LOG_INFO, "WK2132: Registered %s for port %d\n", devpath, i + 1);
	}

	syslog(LOG_INFO, "WK2132: Successfully registered all %d devices\n", num_ports);
	return OK;

cleanup:
	/* Cleanup on failure */
	syslog(LOG_WARNING, "WK2132: Cleaning up %d partially initialized devices\n", i);

	for (int j = 0; j < i; j++) {
		if (devs[j]) {
			/* Note: uart_unregister would be called here if it existed */
			/* For now, we'll just free the memory */
			if (devs[j]->xmit.buffer) {
				kmm_free(devs[j]->xmit.buffer);
			}

			if (devs[j]->recv.buffer) {
				kmm_free(devs[j]->recv.buffer);
			}

			if (devs[j]->priv) {
				nxsem_destroy(&((FAR struct wk2132_dev_s *)devs[j]->priv)->exclsem);
				kmm_free(devs[j]->priv);
			}

			kmm_free(devs[j]);
			devs[j] = NULL;
		}
	}

	return ret;
}
